Page({

  /**
   * 页面的初始数据
   */
  data: {
    resultList: ["电脑", "打印机", "复印机", "传真机", "扫描仪", "投影仪", "电视机", "空调机", "报纸", "复印纸", "宣传单", "包装纸", "信封", "硬纸板", "纸板箱", "包装盒", "点心盒", "纸巾盒", "牛奶盒", "饮料利乐包装", "PET塑料瓶", "矿泉水瓶", "饮料瓶", "硬质塑料瓶", "塑料盒", "冰淇淋盒", "塑料杯", "酸奶杯", "果冻杯", "软桶", "塑料泡沫", "气泡缓冲材料", "水果网套", "废弃塑料文具", "玻璃瓶", "白炽灯", "碎玻璃片", "其他玻璃制品", "金属罐", "易拉罐", "金属盒", "其他金属制品", "金属文件柜", "沙发", "茶几", "办公桌", "文件柜", "皮带", "纸", "篮球", "苹果耳机", "木质梳子", "香水瓶", "金属地漏", "旧书包", "旧手提包", "旧鞋子", "旧塑料篮子", "旧玩偶", "玻璃壶", "旧铁锅", "不锈钢垃圾桶", "猫罐头", "旧帽子", "废锁头", "雨伞骨架", "旧纸袋", "纸盒", "旧玩具", "广告用纸", "暖水瓶", "废弃衣服", "桌布", "布包", "塑料包装", "铁皮罐头", "玻璃", "金属制品", "报废车辆", "家电家具", "玻璃烟灰缸", "泡沫箱", "墨水瓶", "塑料垃圾桶", "塑料饮料瓶", "吸铁石", "塑料假花", "指南针", "酒瓶", "自行车轮胎", "耳机", "袜子", "竹签", "旧衣服", "轮胎", "酸奶盒", "地板砖", "塑料壳", "护肤品玻璃罐", "烟盒", "奶粉罐", "玻璃杯", "塑料瓶瓶盖", "泡沫盒子", "快递盒", "锡纸", "废旧电子产品", "鞋垫", "过滤网", "银行卡", "皮鞋", "剃须刀", "办公用纸", "广告纸片", "打印纸", "杂志", "吹风机", "剪刀", "菜刀", "刀片", "塑料盆", "塑料桶", "塑料日用品", "塑料餐具", "铁钉", "鼠标", "塑料纸", "插座", "电线", "充电装置", "充电线", "数据线", "充电宝", "水泥砖", "保温瓶", "矿泉水桶", "可乐瓶", "雪碧瓶", "废旧木柴", "保温袋", "碎纸", "铁盒", "插线板", "电风扇", "水龙头", "毛毯", "净水器", "信用卡", "抗光屏", "幕布", "地球仪", "塑料拖鞋", "空气净化器过滤网", "化妆品瓶", "草稿纸", "抱枕", "指甲钳", "未被污染的输液瓶", "未被污染的输液袋", "啤酒瓶", "手机", "养乐多瓶", "溜冰鞋", "废电路板", "藤条", "棕榈蜡", "消毒液瓶", "自行车", "无纺布", "洗面奶瓶", "床垫", "木板", "铝箔纸", "铁制品", "铝制品", "铜制品", "平板玻璃", "泡沫塑料", "可乐罐", "雪碧罐", "废旧小家电", "打印机墨盒", "卫生纸内芯", "可口可乐瓶", "笔记本电脑", "电饭煲", "塑料玩具", "洗发水瓶", "护发素瓶", "洗衣液瓶", "消毒液瓶", "充电器", "被单", "羊毛衫", "皮包", "皮具", "食用油桶", "绳子", "台历", "塑料衣架", "铝膜", "吊牌", "塑料水管", "铁管", "铜管", "塑复钢管", "铝塑复合管", "金属管", "被子", "红酒瓶", "香槟瓶", "白酒瓶", "可乐瓶瓶盖", "电动玩具", "镜片", "照相机", "塑料花盆", "无纺布手提袋", "纸箱", "iPad", "墨汁瓶", "手表", "作业本", "扫地机", "化妆水瓶", "护肤品瓶", "护肤乳液瓶", "酱油瓶", "床单", "钢琴", "钥匙", "项链", "手链", "手镯", "耳环", "电脑包", "公文包", "钟表", "木头", "电吹风", "碎玻璃制品", "主板", "电动牙刷", "塑料包装纸盒", "金属香炉", "铅球", "脸摩仪", "脉动饮料瓶", "跑步机", "手电筒", "护发素瓶", "钉子", "螺钉", "糖果罐", "毛绒玩具", "拖鞋", "雨鞋", "垃圾桶", "烧水壶", "摄像头", "吸铁石", "电冰箱", "洗衣机", "布质化妆包", "电烤箱", "洗碗机", "路由器", "扫地机器人", "手表", "晾衣架", "面霜瓶", "订书机", "糖果盒", "电话机", "地毯", "小提琴", "塑料架", "保温杯", "微波炉", "U盘", "茶叶罐", "月饼盒", "酒精瓶", "座椅垫", "蛋挞盒", "纸质卡片", "移动硬盘", "KFtype纸袋", "麦当劳纸袋", "爽肤水瓶", "啤酒瓶盖", "裤子", "有机玻璃", "旧报纸", "电热毯", "真空压缩袋", "台灯", "螺丝", "尼龙袋", "蛇皮袋", "信封", "纸塑铝复合包装", "油桶", "乳液瓶", "食品保鲜盒", "乳液罐", "衣架", "玻璃放大镜", "窗玻璃", "锅", "刀", "螺丝刀", "枕头", "木积木", "砧板", "电子血压仪", "塑料饭盒", "木凳", "靠垫", "靠枕", "遥控器", "手办", "收音机", "铃铛", "棉布", "名片", "咖啡隔热纸", "毛线", "塑料梳子", "食品空罐头", "旧锁", "电瓶", "纱线手套", "不锈钢杯子", "不锈钢勺子", "乐扣乐扣", "木质拼板", "键盘", "眼霜罐", "马桶盖", "饮料瓶盖", "玻璃锅盖", "棉花被", "防晒衣", "游戏手柄", "擀面杖", "交通卡", "地铁票", "灭火器", "脸盆", "脚盆", "洗脸仪", "弹簧", "电动剃须刀", "充电牙刷", "电炖锅", "高压锅", "热水袋", "充电热水袋", "玻璃碎片", "废钥匙", "显卡", "高跟鞋", "干净饮料瓶", "废报纸", "旧被单", "布鞋", "废旧吸铁石", "冰红茶利乐包装", "花露水玻璃瓶", "金属瓶盖", "香烟盒", "香烟壳", "黄金", "金手链", "金项链", "金戒指", "热水瓶", "脚垫", "钢化玻璃", "纸质杯套", "塑料杯套", "衬衫", "星巴克纸袋", "泡沫板", "木梳", "木条", "木棍", "簪子", "鼓棒", "泡沫板", "奥特曼玩具", "洗手液瓶", "金耳环", "滑板", "牛仔裤", "电源插头", "信封", "信纸", "蜂蜜罐", "画框", "洗涤液瓶", "二手手机", "收银条", "腰带", "电动卷发棒", "洗洁精瓶", "除湿机", "拖把桶", "枕套", "台布", "布艺窗帘", "软玻璃", "水晶板", "塑料收纳盒", "钨丝灯", "鲜奶盒", "美工刀", "球鞋", "运动鞋", "课本", "草稿本", "鞋带", "干发帽", "铝箔袋", "衣服吊牌", "纸质礼品盒", "易拉罐拉环", "鼠标", "书包", "铁调羹", "铁盒子", "木筷", "浴帘", "泳帽", "泳衣", "电动保温箱", "起钉器", "消费卡", "购物卡", "会员卡", "密胺餐具", "步步高学习机", "啤酒罐", "塑料晾衣杆", "金属零件", "布娃娃", "皮夹", "旧布鞋", "金子", "金器", "书本", "拉杆箱", "棉被", "金属钥匙扣", "午餐肉罐头", "帆布包", "帆布袋", "变形金刚", "皮质钱包", "钢化膜", "肯德基纸袋", "纸牌", "旧拖鞋", "塑料酸奶盒", "剃须刀片", "老干妈瓶子", "洁厕灵瓶子", "网线", "耳钉", "奥特曼卡片", "钻石", "海报", "旧枕头", "亚克力板", "牛奶瓶", "衣服干洗剂瓶", "速冻食品保温袋", "泡沫保温箱", "玩具盒", "玩具塑料盒", "矿泉水瓶盖", "垃圾箱", "望远镜", "太空望远镜", "铁丝", "铜丝", "金属门吸", "吸门器", "瑜伽垫", "旧瑜伽垫", "纸袋子", "塑料膜", "铁罐", "鸡蛋盒", "隐形眼镜包装盒", "拍拍净瓶罐", "喜糖铁盒子", "废旧报纸", "磁带播放器", "收音机", "说明书", "纸质印刷品", "啤酒盖", "接线板", "排插", "星巴克杯托", "磁铁", "料酒瓶", "木质拖把杆", "金属拖把杆", "小木棍", "硬板纸", "旧皮鞋", "巴黎水玻璃瓶", "自拍杆", "置物架", "球拍", "清洁剂瓶", "木质玩具", "高尔夫球杆", "铜线", "快递纸箱", "旧相机", "计算器", "乐高玩具", "棉拖鞋", "脏袜子", "羽毛球拍", "乒乓球拍", "电子灭蚊拍", "塑料瓶盖", "卷筒纸芯", "卡纸", "奶粉桶", "玩具塑料包装纸盒", "曲奇铁罐", "蓝罐曲奇盒", "塑料标签", "保鲜膜带齿盒", "内存卡", "内存条", "背包", "酸奶玻璃瓶", "机箱", "芯片", "鞋盒", "typePU", "洗发露瓶", "漱口水瓶", "雨伞伞面", "电脑机箱", "塑料碗", "文件夹", "计算器", "电话机", "玻璃渣", "精华玻璃瓶", "PS有害垃圾", "蜂蜜柚子茶玻璃罐", "拖线板", "包书纸", "洁厕液瓶", "玻璃密封容器", "复印机", "牛皮纸", "铅笔盒", "玻璃电子秤", "体重秤", "打印机色带", "电熨斗", "布料制品", "显示屏", "蜜蜡", "环保袋", "暖壶胆", "玻璃蜡烛杯", "雪弗板", "快递纸袋", "热水瓶胆", "木盒子", "热敏纸", "塑料管道", "铁钩", "枕芯", "旧跑鞋", "行李箱", "麦当劳咖啡杯杯盖（印有可回收标志）", "肯德基豆浆杯盖（印有可回收标志）", "羽绒服", "无纺布包", "保温壶", "金属晾衣杆", "足球", "橄榄球", "皮球", "无纺布袋", "围巾", "广告单", "塑料桌布", "炒菜铁锅", "电钻", "铁衣架", "塑料油壶", "塑料晾衣架", "显示器", "网卡", "口香糖塑料盒", "美年达饮料瓶", "圆规", "布鞋套", "青铜", "皮料", "布料", "档案袋", "电锯", "钢尺", "水槽过滤网", "醋瓶", "合金筷子", "螺丝钉", "加湿器", "饮料玻璃瓶", "玻璃花瓶", "旧剪刀", "煤气罐", "鱼缸", "电热水壶", "地毯", "Kilitterdle", "榨汁机", "搅拌器", "鱼竿", "芭比娃娃", "塑料储物箱", "脱排油烟机", "燃气灶", "童鞋", "闹铃", "闹钟", "电水壶", "旅行箱", "塑料模型", "首饰盒", "味全果汁瓶", "榨果汁机", "电磁炉", "百叶窗", "金属鱼钩", "饼干盒", "风衣", "橡胶拖鞋", "大衣", "化妆品外包装纸盒", "电瓶车防晒垫", "点钞机", "罐头瓶", "环保布质垃圾袋", "浴室防滑垫", "试卷", "游戏机", "手机屏", "棉签盒", "移动电源", "平底锅", "羊毛被", "榔头", "iPholittere", "翡翠手镯", "电扇", "汽车模型", "秋裤", "铁皮盖", "食用油玻璃瓶", "铝盖", "奶粉罐铝盖", "洗衣液桶", "吉他", "电子洗牙器", "酱菜瓶", "腐乳瓶", "维他奶包装", "易拉罐盖", "指甲刀", "牙膏盒", "搓衣板", "咖啡杯套", "果酱瓶", "佐料瓶", "丝绸", "毛皮", "椰奶盒", "塑料文件袋", "日历", "无人机", "美肤仪", "洁面仪", "帐篷", "哑铃", "健身器材", "纯牛奶纸盒", "电动刮痧板", "沐浴露瓶", "大提琴", "水果刀", "连衣裙", "丝带", "塑料沙漏", "手机支撑架", "滴露瓶", "USB线", "塑料拖把杆", "番茄酱瓶", "牛奶塑料瓶", "旧窗帘", "椰汁瓶", "花露水塑料瓶", "手机充电宝", "手机充电器", "凉鞋", "节能灯插座", "洗洁精瓶", "花洒软管", "软塑料隔热垫", "话筒", "相框", "银行账单", "垫子", "喷火枪", "酸奶瓶", "打气筒", "神仙水瓶", "被套", "枕套", "塑料调色盘", "木勺", "卷纸内芯", "卷筒纸内芯", "椰奶罐", "卷纸芯", "木棒", "五金材料", "塑料锅铲", "木质锅铲", "牙线盒", "乐扣塑料盒", "乐扣玻璃盒", "线路板", "木质花架", "传单", "绿茶包装盒", "电蒸锅", "钻戒", "银戒指", "即冲奶茶包装盒", "电容", "电阻", "二极管", "三极管", "废食用油瓶", "开关", "鸡蛋包装盒", "黑板", "豆浆机", "开关", "铁罐子", "typeD塑料盒", "香薰玻璃瓶", "真皮制品", "羊皮制品", "皮草制品", "化妆品玻璃瓶", "蚊帐", "打底裤", "光驱", "帆布鞋", "休闲鞋", "关东煮隔热杯套", "手机", "烫衣板", "鸡蛋塑料保护壳", "蚝油瓶", "金属", "人造革", "皮革", "PU革", "蜜饯塑料罐", "机顶盒", "沙拉酱瓶", "皮箱", "木质猫爬架", "汽水瓶", "麻油瓶", "练习册", "手风琴", "玩具枪", "瓦斯罐", "塑料米袋", "测试卷子", "字帖纸", "药品说明书", "牛皮纸袋", "电子表", "书架", "柔顺剂瓶", "黄桃罐头", "音箱", "音响", "塑料玩具车", "笔记本电源", "电子手表", "塑料尺", "皮尺", "磁力贴", "橡胶玩具", "杯垫", "领结", "电蚊拍", "气垫梳", "USB风扇", "A有害垃圾纸", "排球", "保龄球", "自行车内胎", "本子", "LED手电筒", "呼啦圈", "AD钙奶瓶", "水准仪", "无线充电器", "铝条", "酱油玻璃瓶", "牛奶利乐包装盒", "金属夹", "裁剪刀", "平板电脑", "香精瓶", "农夫山泉矿泉水瓶", "丝巾", "MP可回收物", "凳子", "漱口塑料杯", "婴儿手推车", "未受污染纸制品", "旧书", "八宝粥罐", "椰汁盒", "塑料娃娃", "服装面料", "布玩偶", "安慕希酸奶盒", "车钥匙", "塑料头盔", "麦克风", "袖套", "沙发坐垫", "纸质牛奶盒", "木质砧板", "螺纹帽", "螺纹盖", "笔筒", "铁拉链", "收纳箱", "玻璃水瓶", "塑料漏勺", "椅套", "无线耳机", "蓝牙耳机", "吸尘器", "汽车坐垫", "铅丝", "巧克力礼盒包装"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function () {
    
  },
  ToRecyclable: function (e) {
    wx.redirectTo({
      url: '../recyclableWaste/recyclableWaste'
    })
  },
  ToHarmful: function (e) {
    wx.redirectTo({
      url: '../harmfulWaste/harmfulWaste'
    })
  },
  ToWet: function (e) {
    wx.redirectTo({
      url: '../wetWaste/wetWaste'
    })
  },
  ToDry: function (e) {
    wx.redirectTo({
      url: '../dryWaste/dryWaste'
    })
  },
  detail: function (e) {
  }
})