Page({

  /**
   * 页面的初始数据
   */
  data: {
    resultList: ["废弃药瓶", "充电电池", "手机电池", "废荧光灯管", "废节能灯", "废水银温度计", "废水银血压计", "过期药品", "废油漆", "废农药", "杀虫剂", "节能灯（含水银）", "LED 灯（含水银）", "油漆桶", "镍镉电池", "酒精", "调色板", "过期的胶囊药物", "过期药片", "蓄电池", "医用棉签", "医用手套", "农药瓶", "医用纱布", "口服液瓶", "废弃灯泡", "灯泡", "油漆笔", "锂电池", "生石灰", "胶卷底片", "废矿物油", "消毒剂", "胶片", "废血压计", "废镍镉电池", "氧化汞电池", "工业胶水", "胶合剂", "树脂", "染发剂", "染发膏", "钮扣电池", "硒鼓", "照片", "指甲油瓶子", "雷达瓶子", "塑料药盒", "过期指甲油", "卸甲膜", "医用针管", "膏药", "药瓶", "药包装", "咳嗽药水瓶", "塑料药瓶", "药片包装", "药品包装袋", "一次性注射器", "玻璃药瓶", "开塞露", "板蓝根冲剂", "口服液", "铅酸电池", "荧光灯", "卤素灯", "卸甲水", "染发剂壳", "水银体温计", "老鼠药", "杀虫喷雾", "X光片", "感光胶片", "相片底片", "日光灯", "深海鱼油", "感冒药", "眼药水", "录像带", "笔记本电脑电池", "过期感冒药", "冻干粉", "杀虫子罐", "染发手套", "胶囊", "钙片", "保健品", "药膏", "药膏包装壳", "眼药水瓶", "药水玻璃瓶", "空药瓶", "空调清洗消毒液瓶", "药剂", "安神补脑液瓶", "蟑螂药", "过期西药", "西药", "药品纸盒", "伤筋膏药", "伤筋药膏包装", "止痛膏", "烫伤膏", "纸药盒", "除渍剂", "西药瓶", "保健品瓶子", "给药器", "松节油", "维生素瓶", "药液袋", "药片铝塑包装", "医用注射器", "输液瓶", "碳粉盒", "化学剂桶", "胶水桶", "马应龙", "鱼油胶囊", "药壶", "碘酒瓶", "外敷伤药", "中成药", "膏药布", "透明塑料药瓶", "樟脑丸", "电灯泡", "金霉素眼药膏", "咳嗽药片", "达克宁药膏", "达克宁药膏皮", "卸甲油", "止咳糖浆瓶", "痔疮膏", "药丸", "泡腾片", "烫伤药", "滴眼液", "西瓜霜", "西瓜霜含片", "金嗓子含片", "药罐", "维生素", "口服液瓶盖", "灭蚊喷雾剂", "红花油", "西瓜霜含片塑料铝箔包装", "鱼肝油盒", "咳嗽糖浆玻璃瓶", "除草剂", "废胶卷", "鱼肝油", "喷漆罐", "膏药包装", "口服液吸管", "感冒药包装", "过期化妆品"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function() {
    
  },

  ToRecyclable: function(e) {
    wx.redirectTo({
      url: '../recyclableWaste/recyclableWaste',
    })
  },
  ToHarmful: function(e) {
    wx.redirectTo({
      url: '../harmfulWaste/harmfulWaste'
    })
  },
  ToWet: function(e) {
    wx.redirectTo({
      url: '../wetWaste/wetWaste'
    })
  },
  ToDry: function(e) {
    wx.redirectTo({
      url: '../dryWaste/dryWaste'
    })
  },
  detail: function (e) {
  }
})