Page({

  /**
   * 页面的初始数据
   */
  data: {
    resultList: ["剩菜剩饭", "食物残渣", "菜叶", "肉类", "鱼虾", "蛋壳", "树枝", "鱼骨头", "果皮", "鱼鳞", "树叶", "瓜子壳", "花生壳", "茶渣", "葱", "饼干", "番茄酱", "土豆", "甘蔗", "藜麦", "鸡骨头", "鸭骨头", "鹅骨头", "虾", "蛋糕", "面包", "草莓叶", "番茄", "梨", "米饭", "辣椒", "粥", "豌豆皮", "苹果核", "韩国泡菜", "普洱茶", "茄子", "残枝落叶", "草莓", "豆沙包", "植物枝干", "杂菜", "动物尸体", "牲畜粪便", "橘子皮", "香蕉皮", "苹果皮", "西瓜皮", "芒果皮", "葡萄皮", "山竹壳", "橙皮", "洋葱皮", "蘑菇", "糖", "盐", "味精", "鸡精", "酱料", "红枣", "香菇", "中药渣", "宠物饲料", "矿物猫砂", "食用油", "话梅", "花瓣", "牛排", "喜糖", "咖啡残渣", "大白菜", "田螺肉", "粽子馅", "可降解垃圾袋", "宠物粪便", "芝麻", "鲜花", "咖啡渣", "鲜花瓣", "狗粮", "三文鱼头", "豆腐猫砂", "冬枣", "大蒜叶", "杏核", "板栗壳", "纸质吸管", "菜皮", "茶叶渣", "花生", "小龙虾壳", "榴莲酥", "榴莲肉", "枇杷核", "百香果壳", "菠萝", "食品添加剂", "面条", "豆制品", "动物内脏", "虾壳", "脆枣", "废弃食用油", "废弃调味品", "菌菇", "糖果", "巧克力", "甘蔗渣", "枣核", "水蜜桃肉", "火龙果", "火锅底料", "螺蛳肉", "排骨", "猫粮", "蒜皮", "叉烧酥", "菠萝皮", "开心果", "南瓜籽", "香瓜子", "青椒", "蒜头", "毛豆壳", "鸡肉", "鸭掌", "鱼肉", "荔枝核", "西瓜籽", "荔枝皮", "方便面面条", "葡萄籽", "螺蛳壳", "老鼠", "包裹着猫屎的豆腐猫砂", "西兰花", "茭白", "茭白叶", "葡萄干", "芒果核", "火龙果皮", "椰肉", "香蕉", "苹果肉", "桃核", "香瓜皮", "扁豆", "玉米须", "松子壳", "兔子粪便", "螃蟹壳", "西餐糕点", "鸡脚爪", "鸭爪", "山楂", "鸭脖", "鸡翅", "鸭翅", "扇贝肉", "豆腐", "火锅渣", "布丁", "馒头", "包子", "奶茶中的珍珠", "燕麦", "鸡蛋", "果冻", "杂草", "薯格", "甜品", "荔枝壳", "蔬菜", "水果", "笋壳", "冬笋壳", "枯树叶", "蔬菜残余", "西兰花梗", "桂圆壳", "奶粉", "桃子", "麻辣烫", "压缩饼干", "花蛤", "花生衣", "竹笋", "胡萝卜", "结团猫砂", "姜", "绿豆", "红豆", "熟鸡蛋壳", "蟑螂", "蚊子", "咸鸭蛋壳", "西瓜子", "盒饭", "奶油", "豆芽", "杏仁饼", "猫屎咖啡", "大米", "黄油", "水果干", "鸡腿", "鸭腿", "车厘子核", "汉堡", "猪蹄", "平菇", "金针菇", "茨菇", "青菜", "藕片", "葡萄梗", "西红柿", "咖啡豆", "黄瓜", "丝瓜皮", "烂水果", "鸡皮", "海瓜子壳", "炸鸡", "桂皮", "鸡蛋仔", "蛋挞", "螺蛳", "猪蹄骨", "南瓜皮", "过期大米", "过期糖", "过期巧克力", "芝士", "巧克力酱", "李子", "鸟粪", "栗子", "栗子壳", "核桃肉", "李子核", "鱼刺", "薯条", "大闸蟹", "大闸蟹壳", "樱桃核", "柠檬皮", "柚子皮", "蛋黄", "蛋白", "干果仁", "笋皮", "橄榄核", "姜糖", "瓜子皮", "过期食品", "韭菜", "虾头", "皮皮虾壳", "牛蛙", "牛蛙骨", "杨梅核", "多肉植物", "过期调味料", "孜然粉", "辣条", "蜂蜜", "红豆糕", "叉烧", "菠萝包", "干面条", "干脆面", "出前一丁面条", "多宝鱼骨头", "花卉", "草本植物", "小核桃肉", "凋谢的鲜花", "咖啡豆渣", "蚌肉", "盐水花生", "盐水花生壳", "豆浆渣", "红枣核", "枣子核", "面粉", "咖啡粉", "桔子皮", "橘子", "牛油果皮", "橙子", "油桃肉", "水蜜桃", "樱桃干", "龙虾片", "瓜果", "土豆泥", "废弃植物", "玉米猫砂", "油烟机油脂", "油条", "紫薯皮", "燕麦片", "小米", "糯米", "白糖", "咸菜", "萝卜干", "榨菜", "油桃核", "披萨", "大排", "酸豆角", "牛肉", "苍蝇", "鸭肉", "杏仁", "话梅肉", "鱼皮花生", "咸蛋黄", "冬瓜皮", "冬瓜", "咖啡伴侣粉", "虫子", "苦瓜", "小龙虾头", "石榴", "石榴籽", "海苔", "叫化鸡", "花椒", "干辣椒", "山药", "土豆皮", "炒花生米", "蟹肉", "虾肉", "速冻水饺", "速冻馄饨", "棒棒糖", "蛤肉", "爆米花", "小龙虾肉", "青豆泥", "鸡排", "薯片", "桔梗", "樱桃梗", "水果皮", "花甲", "皮蛋", "咸蛋", "猕猴桃", "奇异果", "花甲壳", "海底捞锅底", "牛肉干", "椰果", "鸭下巴", "芝麻酱", "花生酱", "茴香", "小龙虾黄", "三文鱼", "肯德基炸鸡", "麦当劳炸鸡", "午餐肉", "面饼", "鸡蛋饼", "煎饼", "哈密瓜", "哈密瓜籽", "干树叶", "绿箩", "绿豆糕", "红豆糕", "乒乓糯米糍", "杏仁核", "黄杏核", "茶叶", "铁观音", "乌龙茶", "白茶", "桔普茶", "水草", "海藻", "海苔", "水果软核", "咖喱粉", "瓜子", "大蒜皮", "扇贝壳", "咸蛋壳", "鸭蛋壳", "凤梨皮", "面包屑", "小龙虾", "香榧子壳", "鸡蛋皮", "腰果", "胡椒粉", "凤梨酥", "苹果派", "蹄膀", "桂圆核", "甲鱼", "鱼内脏", "奶酪", "酒酿", "八角", "玉米芯", "黄瓜皮", "橙子皮", "生鸡蛋壳", "花茶渣", "八宝粥", "艾草", "年糕", "红薯", "荷叶", "柚子核", "青蟹壳", "山楂片", "红辣椒", "巧克力粉", "鸭架", "白砂糖", "红肠", "鸽粪", "桃子皮", "桂圆干", "中草药", "中草药材", "梭子蟹", "梭子蟹壳", "河虾", "白米虾", "象鼻蚌", "曲奇", "水蜜桃核", "蛋挞皮", "膨化食品", "糯米纸", "鸡蛋卷", "鸡蛋壳", "黄豆", "软糖", "豆干", "豆腐干", "冬瓜籽", "向日葵花束", "葵花子", "炒花生壳", "枯萎花束", "桃子核", "笋干", "陈皮", "白煮蛋", "花蛤肉", "枣核", "乐事薯片", "蛋黄酥", "油条", "油墩子", "大饼", "葱油饼", "山东煎饼", "碎骨头", "枸杞", "果酱", "猪肝", "碧根果肉", "茭白皮", "大葱", "西红柿", "黄瓜", "西葫芦", "猪肉", "小排骨", "沙拉酱", "拉菲草", "大白兔奶糖", "猕猴桃皮", "南瓜子壳", "桃仁", "苹果皮", "杨梅", "蚕豆", "蚕豆壳", "杨梅干", "带子壳", "玉米塑料袋", "鸭头", "翅尖", "番茄沙司", "巴旦木", "玫瑰花", "蛋卷", "鱼", "枯枝", "叶子", "苹果", "鸭舌", "树皮", "芋圆", "黄芪", "三七粉", "槟榔", "章鱼", "彩虹糖", "鱿鱼", "鱿鱼丝", "生蚝肉", "枇杷", "烤鸭", "北京烤鸭", "山芋", "洋山芋", "芋头", "铁棍山药", "瓜子", "鸭锁骨", "蓝莓", "海星", "黑椒牛排", "仙人掌", "芹菜", "面粉", "杨桃", "胡萝卜皮", "生肉", "皮蛋壳", "山楂干", "番茄皮", "番茄梗", "鲜花饼", "公丁香", "薄荷叶", "花甲粉", "冷饮", "金丝皇菊", "油墩子", "火腿肠", "藏红花", "基围虾", "基围虾壳", "烘山芋皮", "茶叶蛋壳", "仙人球", "咸鱼", "咸鸡", "烤鸡", "盐水鸭", "银耳", "意大利面", "烧饼", "臭豆腐", "冰淇淋", "生姜", "红薯皮", "雪花酥", "锅巴", "干桂圆壳", "丝瓜", "玉米粒", "胖大海", "干面粉", "薰衣草", "干花生壳", "猫冻干", "麻辣香锅残渣", "菠萝蜜肉", "五香蛋", "莴苣", "蒲公英", "小笼包", "灌汤包", "梨核", "德克士炸鸡", "鲫鱼", "鳜鱼", "粉丝", "海带", "木耳", "花草茶渣", "肉夹馍", "粗盐", "海胆", "豆杆", "青豆", "青豆萁", "饺子皮", "馄饨皮", "白瓜子", "煎饼果子", "小葱", "木瓜", "木瓜籽", "可降解吸管", "葵花子壳", "小肉骨头", "螺蛳粉", "芋艿皮", "芋艿", "花椒粉", "绿豆沙", "荞麦", "荞麦面", "阿胶", "宽粉条", "毛豆皮", "麦片", "可降解纸吸管", "调制海藻面膜", "桂花糕", "牛筋", "猪皮", "臭虫", "芡实糕", "牛轧糖", "牛轧糖", "火鸡骨头", "鸡头", "鸡屁股", "猪排", "猪扒", "蜗牛", "鱼饲料", "银杏果", "麻花", "鱼头", "早餐谷物", "瓜子仁", "猪小排", "猪肉排骨", "玉米纤维袋", "话梅核", "乌梅壳", "甜芦粟", "山竹核", "松子", "鸡软骨", "杏子核", "蜜饯", "虾皮", "虾米", "蟠桃核", "辣条", "手擀面", "牛肉干", "甲鱼小骨", "猪肋排", "里脊肉", "木薯淀粉", "香蕉干", "芒果干", "鸭皮", "寿司", "豆腐花", "鱼豆腐", "面团", "沙拉酱", "干香菇", "腊肉", "饭团", "菜饭", "干蘑菇", "鸡翅骨", "莴笋", "虾线", "酸菜鱼", "酸菜", "梅干菜", "红烧肉", "汉堡包", "大龙虾肉", "蛋白粉", "鸡腿菇", "鸡腿骨", "兰花豆", "香榧子", "香榧子壳", "生煎包", "煲仔饭", "锅贴", "芥末", "杨桃籽", "杨桃", "鱼肠", "鱼泡", "鸭肠", "黄桃", "陈皮梅", "西梅", "栀子花", "兰州拉面", "芦荟", "素鸡", "蒜瓣皮", "玫瑰", "烧卖", "牛肉煎包", "柠檬", "雪花蟹壳", "花螺", "松果", "柠檬片", "干柠檬片", "润喉糖", "土豆泥", "苹果派", "香芋派", "冰粉", "薄荷糖", "奶油", "玉米棒", "树莓", "蔓越莓", "双皮奶", "蛋黄派", "马卡龙", "香干", "抹茶粉", "红枣干", "黑椒酱", "豆腐乳", "腐乳", "蚯蚓", "桃胶", "黄鱼", "墨鱼", "黑鱼", "菠菜", "凉皮", "椰果", "辣椒酱", "辣酱", "辣椒酱", "干荔枝", "夏威夷果肉", "豆腐脑", "金银花", "紫菜", "鱿鱼丝", "乌贼", "熟蛋黄", "绿豆渣", "包子馅", "辣椒油", "青菜叶", "仙草", "乌梅", "蛋筒", "西柚", "生姜皮", "白色恋人饼干", "茉莉花", "荔枝叶", "甜筒", "圣代", "午餐肉", "竹叶", "猪肉铺", "兰花豆", "秋葵", "当归片", "豆腐皮", "香肠", "香肠衣", "百香果籽", "冒菜", "菱角", "菱角皮", "田螺壳", "蛋黄酱", "兔头骨", "蜗牛壳", "蜘蛛丝", "罐头食品", "干花", "橙子籽", "榴莲瓢", "呕吐物", "茶叶蛋", "蛏子肉", "铁板鱿鱼", "鸡胸肉", "鱼内脏", "鸭胸", "腊肠", "印度飞饼", "飞饼皮", "德国香肠", "烤肠", "台湾香肠", "肉肠", "提子", "提子皮", "荷包蛋", "青柠檬", "柠檬籽", "蛋炒饭", "牛筋", "章鱼小丸子", "跳跳糖", "海蜇皮", "糯米", "当归", "赖尿虾壳", "皮皮虾", "豆瓣酱", "金桔", "金桔籽", "哈密瓜皮", "鲜花饼"]
  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function() {
    
  },

  ToRecyclable: function(e) {
    wx.redirectTo({
      url: '../recyclableWaste/recyclableWaste'
    })
  },
  ToHarmful: function(e) {
    wx.redirectTo({
      url: '../harmfulWaste/harmfulWaste'
    })
  },
  ToWet: function(e) {
    wx.redirectTo({
      url: '../wetWaste/wetWaste'
    })
  },
  ToDry: function(e) {
    wx.redirectTo({
      url: '../dryWaste/dryWaste'
    })
  },
  detail: function (e) {
  }
})